app/views/reviews/index.html.erb

SELECT "reviews".* FROM "reviews" WHERE "reviews"."movie_id" = ?  [["movie_id", 1]]
---

<%= link_to pluralize(@movie.reviews.size, "review"), movie_reviews_path(@movie) %>